read_verilog ../sims/verilator/generated-src/chipyard.TestHarness.Sodor1StageConfig/chipyard.TestHarness.Sodor1StageConfig.top.v

hierarchy -top SodorInternalTile
hierarchy -check

proc; opt; fsm; opt; memory; opt;
techmap; opt
clean

write_verilog -noattr rtl/sodor1_coremem_top.v